_sdaiAttributeDomain(Sdai_instS*)
\details
Retrieves the primitive type (domain) of a specified attribute.
\param attribute [in] An attribute.
\returns A primitive type that represents the current attribute domain.